app/assets/HP Easy Start.app/Contents/Resources/ProbeMessage.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:hpd="http://www.hp.com/schemas/imaging/con/discovery/2006/09/19"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action><wsa:MessageID>urn:uuid:%@</wsa:MessageID></soap:Header><soap:Body><wsd:Probe><wsd:Types>hpd:hpDevice</wsd:Types></wsd:Probe></soap:Body></soap:Envelope>